{
  "title": "Key portion of Nancy Grace Roman Space Telescope clears thermal vacuum test",
  "authorDate": "",
  "content": [
    "MAY 7, 2025",
    "This article has been reviewed according to Science X's                editorial process               and policies.               Editors have highlighted               the following attributes while ensuring the content's credibility:",
    "fact-checked",
    "trusted source",
    "proofread",
    "by Ashley Balzer, NASA's Goddard Space Flight Center",
    "A major part of NASA's nearly complete Nancy Grace Roman Space Telescope just passed a lengthy thermal test to ensure it will function properly in the space environment.",
    "\"This milestone tees us up to attach the flight solar array sun shield to the outer barrel assembly and deployable aperture cover, which we'll begin this month,\" said Jack Marshall, who leads integration and testing for these elements at NASA's Goddard Space Flight Center in Greenbelt, Maryland. \"Then we'll complete the remaining environmental tests for the flight assembly before moving on to connect Roman's two major assemblies and run the full observatory through testing, and then we'll be ready to launch.\"",
    "Prior to this thermal testing, technicians integrated Roman's deployable aperture cover, a visor-like sunshade, into the outer barrel assembly, which will house the telescope and instruments, in January, then added test solar panels in March. They moved this whole structure into the Space Environment Simulator test chamber at NASA Goddard in April.",
    "There, it was subjected to the hot and cold temperatures it will experience in space. Next, technicians will join Roman's flight solar panels to the outer barrel assembly and sunshade. Then the structure will undergo a suite of assessments, including a shake test to ensure it can withstand the vibrations experienced during launch.",
    "Meanwhile, Roman's other major portion––the spacecraft and integrated payload assembly, which consists of the telescope, instrument carrier, and two instruments––will undergo its own shake test, along with additional assessments. Technicians will install the lower instrument sun shade and put this half of the observatory through a thermal vacuum test in the Space Environment Simulator.",
    "\"The test verifies the instruments will remain at stable operating temperatures even while the sun bakes one side of the observatory and the other is exposed to freezing conditions––all in a vacuum, where heat doesn't flow as readily as it does through air,\" said Jeremy Perkins, an astrophysicist serving as Roman's observatory integration and test scientist at NASA Goddard. Keeping the instrument temperatures stable ensures their readings will be precise and reliable.",
    "Technicians are on track to connect Roman's two major parts in November, resulting in a complete observatory by the end of the year. Following final tests, Roman is expected to ship to the launch site at NASA's Kennedy Space Center in Florida for launch preparations in summer 2026. Roman remains on schedule for launch by May 2027, with the team aiming for launch as early as fall 2026.",
    "Provided by NASA's Goddard Space Flight Center"
  ],
  "url": "https://phys.org/news/2025-05-key-portion-nancy-grace-roman.html"
}